🚧 [OpenTofu plan](https://opentofu.org) 🚧

```txt
module.region["hel01"].local_file.config: Refreshing state... [id=62b91e8a7c693b1175f57661ef5613ab0cfa2c64]

OpenTofu used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

OpenTofu will perform the following actions:

  # module.region["lab01"].kind_cluster.test will be created
  + resource "kind_cluster" "test" {
      + client_certificate     = (known after apply)
      + client_key             = (known after apply)
      + cluster_ca_certificate = (known after apply)
      + completed              = (known after apply)
      + endpoint               = (known after apply)
      + id                     = (known after apply)
      + kubeconfig             = (known after apply)
      + kubeconfig_path        = (known after apply)
      + name                   = "lab01"
      + node_image             = (known after apply)
      + wait_for_ready         = false
    }

Plan: 1 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so OpenTofu can't
guarantee to take exactly these actions if you run "tofu apply" now.
```